#+ATTR_ORG: :width 300 :height 200
** Code notebook
Loading Libraries and reading in data

#+BEGIN_SRC R :session tt
                                        # Loading libraries
library("easypackages")
libraries("tidyverse", "tidyquant")
                                        # Reading in the data directly from github
tv_ratings_raw  <- readr::read_csv("https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2019/2019-01-08/IMDb_Economist_tv_ratings.csv")
#+END_SRC

#+RESULTS:

Let's get a quick overview of the data available.

#+BEGIN_SRC R :session tt
tv_ratings_raw %>% skimr::skim()
tv_ratings_raw %>% glimpse()
#+END_SRC

#+RESULTS:

Observations:
1. We have 7 variables, and all of them appear to be useful.
2. There are no missing values.
3. Each serial has a unique titleId. This can be useful to separate out serials from seasons.
4. what does the 'share' column imply?

To get deeper insight on these serials: the genres have to be separated out. This will allow analysis of the serials based on the Genre.

Viewing the data will show that individual genres are separated by a comma. Though I initially started with 6 splits - I found the maximum to be 3 and there are several with less than 3 genres.

So how many unique genres do we have?

#+BEGIN_SRC R :session tt
                                        # Note:  the unique genres can also obtained by starting with map(unique), and with some further processing.

## test <- tv_ratings_raw %>%
##   separate(genres,
##            into = c("genre1_", "genre2_", "genre3_"),
##            sep = ',' ,
##            remove = FALSE
##            ) %>%
##   select(ends_with("_")) %>%
##   map(unique)

all_genres <-  tv_ratings_raw %>%
  separate(genres,
           into = c("genre1_", "genre2_", "genre3_"),
           sep = ',' ,
           remove = FALSE
           ) %>%
  select(ends_with("_")) %>%
  gather(
    key = genres_col,
    value = genre_all,
    .,
    na.rm = TRUE
  ) %>%
  select(genre_all) %>%
  unique() %>%
  spread(
    key = genre_all,
    value = genre_all
  )
#+end_src

#+RESULTS:
| Action | Adventure | Animation | Biography | Comedy | Crime | Documentary | Drama | Family | Fantasy | History | Horror | Music | Musical | Mystery | Reality-TV | Romance | Sci-Fi | Sport | Thriller | War | Western |

There are *22 unique genre categories*. To enable further analysis and make the data more suitable to machine learning, the genres could be combined with the dataset as separate columns with a logical value denoting whether the serial falls into the category or Not. In addition, it would nice to standardise the genre names formatting, especially those like Sci-If and Reality-TV.

With 22 genre columns to consider, a tidyeval function might help.

#+BEGIN_SRC R :session dsb1
names(all_genres) <- str_c(rep("g_", length(all_genres)), names(all_genres))
tv_ratings_conditioned <- bind_rows(tv_ratings_raw, all_genres)

all_genres %>% glimpse()

genre_flag_fn <- function(data, search_col = genres, search_pattern, flag_col )
{
  flag_col <- enquo(flag_col)
  flag_col_name <- quo_name(flag_col)
  search_col <- enquo(search_col)
  data %>%
    mutate(!!flag_col_name := case_when(
               str_detect(!!search_col, search_pattern)  ~ 1,
               TRUE ~ 0
             )
           )
}

tv_ratings_genre_sep_tbl <- tv_ratings_conditioned %>%
  genre_flag_fn(search_pattern = "Action"      , flag_col = g_Action      ) %>%
  genre_flag_fn(search_pattern = "Adventure"   , flag_col = g_Adventure   ) %>%
  genre_flag_fn(search_pattern = "Animation"   , flag_col = g_Animation   ) %>%
  genre_flag_fn(search_pattern = "Biography"   , flag_col = g_Biography   ) %>%
  genre_flag_fn(search_pattern = "Comedy"      , flag_col = g_Comedy      ) %>%
  genre_flag_fn(search_pattern = "Crime"       , flag_col = g_Crime       ) %>%
  genre_flag_fn(search_pattern = "Documentary" , flag_col = g_Documentary ) %>%
  genre_flag_fn(search_pattern = "Drama"       , flag_col = g_Drama       ) %>%
  genre_flag_fn(search_pattern = "Family"      , flag_col = g_Family      ) %>%
  genre_flag_fn(search_pattern = "Fantasy"     , flag_col = g_Fantasy     ) %>%
  genre_flag_fn(search_pattern = "History"     , flag_col = g_History     ) %>%
  genre_flag_fn(search_pattern = "Horror"      , flag_col = g_Horror      ) %>%
  genre_flag_fn(search_pattern = "Music"       , flag_col = g_Music       ) %>%
  genre_flag_fn(search_pattern = "Musical"     , flag_col = g_Musical     ) %>%
  genre_flag_fn(search_pattern = "Mystery"     , flag_col = g_Mystery     ) %>%
  genre_flag_fn(search_pattern = "Reality-TV"  , flag_col = `g_Reality-TV`) %>%
  genre_flag_fn(search_pattern = "Romance"     , flag_col = g_Romance     ) %>%
  genre_flag_fn(search_pattern = "Sci-Fi"      , flag_col = `g_Sci-Fi`    ) %>%
  genre_flag_fn(search_pattern = "Sport"       , flag_col = g_Sport       ) %>%
  genre_flag_fn(search_pattern = "Thriller"    , flag_col = g_Thriller    ) %>%
  genre_flag_fn(search_pattern = "War"         , flag_col = g_War         ) %>%
  genre_flag_fn(search_pattern = "Western"     , flag_col = g_Western     )

tv_ratings_genre_sep_tbl %>% glimpse()
#+END_SRC

